<?php 

/**
 *
 * 后台操作日志类型对应表
 */

$config['admin_log_type'] = array(
    // 管理员
    1 => '新增管理员',
    2 => '编辑管理员',
    3 => '删除管理员',
    4 => '批量删除管理员',

    // 部门
    5 => '新增部门',
    6 => '编辑部门',
    7 => '删除部门',
    8 => '批量删除部门',

    100 => '新增调度角色',
    101 => '编辑调度角色',
    102 => '删除调度角色',

    110 => '新增运单',
    111 => '编辑运单',
    112 => '删除运单',

    200 => '新增货运公司关联线路',
    201 => '编辑货运公司关联线路',
    202 => '删除货运公司关联线路',

    210 => '新增线路',
    211 => '编辑线路',
    212 => '删除线路',

    300 => '新增司机信息',
    301 => '编辑司机信息',
    302 => '删除司机信息',

    310 => '新增车辆信息',
    311 => '编辑车辆信息',
    312 => '删除车辆信息',

    320 => '新增车辆类型信息',
    321 => '编辑车辆类型信息',
    322 => '删除车辆类型信息',

    330 => '新增车辆长度属性信息',
    331 => '编辑车辆长度属性信息',
    332 => '删除车辆长度属性信息',

    340 => '新增车辆载重属性信息',
    341 => '编辑车辆载重属性信息',
    342 => '删除车辆载重属性信息',

    350 => '已采纳反馈意见',
    351 => '未采纳反馈意见',

    500 => '新增货运公司信息',
    501 => '编辑货运公司信息',
    502 => '删除货运公司信息',

    510 => '新增货主信息',
    521 => '编辑货主信息',
    532 => '删除货主信息',

    600 => '新增积分商品信息',
    601 => '编辑积分商品信息',
    602 => '删除积分商品信息',

    1000 => '设置司机关联调度',
    1001 => '删除司机关联调度',

    1002 => '设置司机关联货运公司',
);

?>